import random

SUR_NAMES_FULL = [
    "ПЕТРЕНКО",
    "ШЕВЧЕНКО",
    "КОВАЛЕНКО",
    "БОЙКО",
    "СИДОРЕНКО",
    "КРАВЧЕНКО",
    "ТКАЧЕНКО",
    "КОВАЛЬЧУК",
    "ПОМАРЕНКО",
    "РУДЕНКО",
    "БОНДАРЕНКО",
    "ГРИШЕНКО",
    "МЕЛЬНИК",
    "КУЗЬМЕНКО",
    "БАРАНЕНКО",
    "ЛИСЕНКО",
    "САВЧЕНКО",
    "ЯЦЕНКО",
    "ДАНИЛЕНКО",
    "ІВАНЕНКО",
    "КАРПЕНКО",
    "ЧЕРНЕНКО",
    "ПАЛАМАРЧУК",
    "СТЕПАНЕНКО",
]

NAMES_FULL = [
    "Іван",
    "Олександр",
    "Михайло",
    "Андрій",
    "Сергій",
    "Володимир",
    "Петро",
    "Юрій",
    "Олег",
    "Тарас",
    "Богдан",
    "Дмитро",
    "Максим",
    "Роман",
    "Назар",
    "Ярослав",
    "Василь",
    "Григорій",
    "Степан",
    "Олексій",
    "Євген",
    "Артем",
    "Матвій",
    "Ігор",
    "Мирослав",
    "Леонід",
]

PATRONYMICS_FULL = [
    "Іванович",
    "Петрович",
    "Олександрович",
    "Михайлович",
    "Андрійович",
    "Сергійович",
    "Володимирович",
    "Юрійович",
    "Олегович",
    "Богданович",
    "Дмитрович",
    "Максимович",
    "Романович",
    "Назарович",
    "Ярославович",
    "Васильович",
    "Григорович",
    "Степанович",
    "Олексійович",
    "Євгенович",
    "Матвійович",
    "Ігорович",
    "Мирославович",
    "Леонідович",
]


def generator_full_random(old_surname: str, old_name: str, old_patronymic: str) -> str:
    _ = (old_surname, old_name, old_patronymic)
    while True:
        new_surname = random.choice(SUR_NAMES_FULL)
        new_name = random.choice(NAMES_FULL)
        new_patronymic = random.choice(PATRONYMICS_FULL)
        return f"{new_surname} {new_name} {new_patronymic}"


SUR_NAMES_INIT = [
    "Коваленко",
    "Шевченко",
    "Бойко",
    "Сидоренко",
    "Кравченко",
    "Ткаченко",
    "Ковальчук",
    "Помаренко",
    "Руденко",
    "Бондаренко",
    "Гришенко",
    "Мельник",
    "Кузьменко",
    "Бараненко",
    "Лисенко",
    "Савченко",
    "Яценко",
    "Даниленко",
    "Іваненко",
    "Карпенко",
    "Черненко",
    "Паламарчук",
    "Степаненко",
    "Олійник",
]

INIT_NAMES = [
    "І",
    "О",
    "П",
    "С",
    "В",
    "Ю",
    "Т",
    "Б",
    "Г",
    "Д",
    "М",
    "Р",
    "Н",
    "Я",
    "Л",
    "К",
]


def generator_init_random(old_surname: str, old_initial: str) -> str:
    _ = (old_surname, old_initial)
    new_surname = random.choice(SUR_NAMES_INIT)
    new_initial = random.choice(INIT_NAMES)
    return f"{new_surname} {new_initial}."
